{"/Features/overview":{"title":"Overview","data":{"":"Feature highlights."}},"/General_info/Hardware-Definitions":{"title":"Hardware Definitions","data":{"component-breakdown#Component Breakdown":"Hotend\nMotion System\nExtrusion System\nBuild Plate\nOther Components","hotend-components-defined#Hotend Components Defined":"Responsible for Extruding molten Plastic onto a heated surface.\nHeater - Usually a dc carterage with a heating element\nThermistor - Repots the surent temperature to the controller. Ensures that the nozzle is hearing as expected.\nThe thermister is the most important safity feature of an FFF 3d printer. All modern 3d printers have thermal runnaway protections that will alert and shut down the printer. Thermal runaway occurs when a Nozzle continues to recieve power with out raising the temperature as expected.\nHeatbreak - The heatbreak is the part of the nozzle where filment moves from a solid to molten plaztic.\nnote: This is where the majority of extrusion issues occure. If the filment is heated too far past its transition point it can melt too far up the heatbreat resulting in a \"Jam\".\nHeat break versions\n--Boaden Lined - PTFE tube meets directly with the nozzle\nnote: PTFE tubes in this configuration wil break down over time and need to be replaced.\n--Metal / bi meatl - The PTFE constraines the filiment path and terminates in a metal heatbreak that meets the nozzle.\nHeatsyc - The heatsync is an aluminum block meant to disopate heat an keep the filiment solid until it reaches the melt zone\nHotend cooling fan - Normally attached to the heatsync, removes heat before the \"melt zone\"\nnote: This is very important to the extrusion system, it this fan stops or is obstructed the hotend will jam.\nPart Cooling Fan - This component transitions the molten plastic from a molten state to a solid state\nnote: Some materals require 100% fan and others may warp. Some may even suffer poor layer adheasion. Fan speed is materal specific.","motion-systems-defined#Motion Systems Defined":"","most-common#Most Common":"Cartesian  - 1 motor per axis X,Y,Z\nCoreXY - X and Y belts both attached to the Hotend Motoin is derived from a combotnation","less-common#Less Common":"Delta - 3 motors move together for one X,Y,Z movments\nHybrid CoreXy - 2 X axis Motors in a Core xy Configuration , Depent dual Y axis motors.\nIDEX - 2 Independent Tool heads with a common Y axis but independent X axis","extrusion-types-defined#Extrusion Types Defined":"","most-common-1#Most Common":"Boaden Extrusion - Remote Filiment Extruder that Feeds filiment into the hotend but is not attached to the X gantry Itself.\nDirect Drive - The Filiment Extruder is Directly Attached to the Hotend Assembly.","less-common-1#Less Common":"IDEX - 2 seperate independent hotends.\nTool Changer - One motion system that can doc and select multipule hotends\nMultiplexing - 2 complete hotends on a single Tool","heat-beds-and-build-plates#Heat Beds and Build Plates.":"HeatPads - Typically DC heaters placed on the underside of an aluminum Plate\nBed Leveling Screws - Adjust the traming of the Bed\nHeatbed Thermister - Like the hotend the headed be thermister ensure the bed is heating properly.","build-plates-materals#Build Plates Materals":"Glass\nPEI\nGarolite","other#Other":"","auto-bed-leveling-sensors#Auto Bed Leveling Sensors":""}},"/General_info/Nozzles":{"title":"Recomended -","data":{"nozzle-and-layer-height-guide#Nozzle and Layer Height Guide":"Model printing times are most affected by a cobonation of layer heright and nozzle size.\nThe majority of 3d printers will come standard with a 0.4 mm nozzle made of brass. A good middle ground between qualty and time is 0.2 mm layer heights.\n| Nozzle Size | Layer Height |\n| 0.4 mm       | 0.2 mm      |\nNozzle Size\tMin Layer Height\t25×25×25 mm Cube Time\tMax Layer Height\t25×25×25 mm Cube Time\tRecommended Line Width\tMax Line Width (+120%)\t0.4 mm\t0.08 mm\t~47 min\t0.28 mm\t~9 min\t0.45 mm\t0.6 mm\t0.6 mm\t0.18 mm\t~12 min\t0.42 mm\t~6.5 min\t0.62 mm\t0.8 mm\t0.8 mm\t0.24 mm\t~9 min\t0.56 mm\t~7 min\t0.82 mm\t1.0 mm\t0.2 mm\t0.06 mm\t~90 min\t0.14 mm\t~45 min\t0.22 mm\t0.3 mm","nozzle-materal#Nozzle Materal":"Materal\tMateral Usage\tCost\tNotes\tOther Considerations\tBrass\tNon abrasive\t$\tStandard on most printers\tReplace often when print quality is lost\tSteal\tAbrasive\t$$\tMore abrasion resistance\tMay require slightly higher temperature\tHardened Steal\tAbrasive\t$$$\tRecomended for abrasive materals\tMay require slightly higher temperature\tDimond Back\tAbrasive\t$$$$$$\tWill last forever\tMay require slightly higher temperature\t\nTypes\tNotes\tMk4 / 8\tSeen on older printers, not as common today\tBondtech CHT\tHigh flow Mk4 / 8\tAll in one\tVendor specific has all hotend components"}},"/Getting-Started/intro":{"title":"Introduction","data":{"":"Get started with your info3d wiki."}},"/":{"title":"Welcome to info3d","data":{"":"This is your documentation homepage."}}}