{"/3d_Files_Sources":{"title":"3d Files Sources","data":{}},"/3d_Modeling/AutoDesk_Suite":{"title":"AutoDesk Suit","data":{"":"There are numerious productus under the AutoDest Suit of Design software here is a brief overview of some notible tools. Many of these tools have hobby and student free access.","fusion-360#Fusion 360":"Hobby licens: Maximum of 4 \"Open\" Projects\nStudent / Teacher Free Access\nOnline Access Required\nFeatures:\nParametric Design\nDesign History\n3d Slicing & CAM avaliable\nBrowser version avaliable","auto-cad#Auto CAD":"","revit#Revit":"","maya#Maya":"","inventor#Inventor":"","3ds-max#3ds Max":"","autodest-edu-software-overview#AutoDest EDU Software overview":""}},"/3d_Modeling/Blender":{"title":"Blender","data":{"blender#Blender":"Blender is an open source tool sponsord by the Blender foundation.It is a suit of tools. Curently There is only a version for Windows and Mac OSThe Blender Suite is capoble of creating entire anamated film with this single Opensource tool.","features#Features:":"Rendering\nModeling\nSculpting\nAnomation & Rigging\nStory Artist\nVFX\nSimulation\nPipeline\nVideo Editing\nScripting\nCustumizable Interface"}},"/3d_Modeling/Fusion360":{"title":"Fusion360","data":{}},"/3d_Modeling/Onshape":{"title":"ONSHAPE","data":{"featurs#Featurs:":"Browser Based\nCompatable with School Chrombooks\nbuilt in tutorials and lessons\npublic library of models\ncommunit addon scripts\nColabritive design","overview#Overview":"Onshape is a browser based parametric Computer aided design software.\r\nThe free acoount has no limmitation, however every model created is accessable to the public.On Shape functions well in a web browser and functions on All devices with internet access.\nThere is a dedicated iPad version with Apple Pincel Support","learning-center#Learning Center":"Onshapes dedicated learning center has many resuources.\nNotiblly there are many interactive walkthrough tutorials\nOnShape Learning"}},"/3d_Modeling/Sculpting":{"title":"Sculpting","data":{"3d-sulpting#3D Sulpting":"3d Scuplting often involves deforming Bodies in a mesh.Blender\nsee section on Blender\nPC Only\nSculptGL\nbrowserbased 3d sculpting program\nNomad Sculpt\nApp only\nWomp\nBrowserbased\n3D Slash\nBrowser based fun tool."}},"/3d_Modeling/TINKER_CAD":{"title":"TINKERCAD","data":{"":"Tinkercad is a free browser-based 3d Creation suit operated by Autodesk\nIn my personal openion tinkercad is one of the most useful tools for young people, education and getting started with 3d Printing and Design.","feature-overview#Feature Overview":"3d Design\nCircuits\nCodeblocks\nSim Lab\nClassroom Tutorial and Lesson Plans\nBrowserbased with iPad AR","3d-design#3d Design":"Positive and Negitve Shapes are combind to make bodies.There is also a text input and QR Code Generator.Once Modeled the Object can be exported as a .OBJ, .STL, .GLTF or .SVG as well as Exporting to Fusion 3603d Simulation\r\nLego and MineCraft Mode","circuits#Circuits":"This simulation enviroments allows you to prototype and program arduino and microbit micro controllers.Blockcoding and Text is avaliable and can be loaded and ran directly on an Arduino or Microbit board.","codeblocks#Codeblocks":"Codeblocks created 3d models using block based coding. This is a great tool to explore mathamatical concepts like the fibonacci sequence.","classroom-lessons-and-interactive-tutorials#Classroom Lessons and Interactive Tutorials":"Tinkercad has a vast array of step by step walk thrus and lessons."}},"/3d_classroom":{"title":"3d Classroom","data":{}},"/Calabration/General_Maintance":{"title":"General Maintance","data":{}},"/Calabration/Handy_Test_Models":{"title":"Handy Test Models","data":{"autodesk-fdm-test-model#Autodesk FDM Test Model":"Autodesk_FDM_Test_Model.stl","3d-benchy#3d Benchy":"The Clasic Boat","voron-cude#Voron Cude":"Voron Test Cube"}},"/Calabration/Materal_Calabration":{"title":"Materal Calabration","data":{}},"/Calabration/PID_Tune":{"title":"Pid Tune","data":{}},"/Calabration/Printer_Calabration":{"title":"Printer Calabration","data":{}},"/Calabration/Tension_Adjustments":{"title":"Tension Adjustments","data":{}},"/Control/Firmware":{"title":"Firmeware","data":{"":"3d printer use micontrolers to send individual movment commands to motors.The resulting motion is a movment in the X Y Z and E (extrusion) axiesThere are 3 main Firmwares that manage these commands\nthere are several maufacturer specefic such as Bambu but most function very semilar.All listed are opensource","reprap#RepRap":"Primarialy uses Duet controlboards\nAll settings controlled via G-Code\nUses the RipRap configurator\nWeb Based Control Interface","marlin#Marlin":"Used on multipul boards\nUses VSCode and the Platform IO extension to build firmware based on config.h and configadv.h files\nHas pre determined setting for most cotrollers and situations. (Config Referances)","klipper#Klipper":"Klipper uses a seperate mcu such as a raspberry pi to process and send commands to the micro controller\nConfiguration based on a printer.cfg file (Config Examples)\nA seperate configuration in needed for the serial id of the micro controller in the moonraker.cfg file\nWeb based Interface\nCan support multiple controllers\nKiauh is useful tool to install this firmware)"}},"/Control/Gcode_Commands":{"title":"Gcode Commands","data":{}},"/Lesson_Plans/Intoduction_to_3d_Printing":{"title":"Intoduction to 3d Printing","data":{}},"/Lesson_Plans/Introduction_to_3d_design":{"title":"Introduction to 3d Design","data":{}},"/Manufaturers_Supplyers":{"title":"Manufaturers Supplyers","data":{}},"/Materals_Overview":{"title":"Materials","data":{"":"This page covers a variety of 3D printing materials with details about their advantages, disadvantages, cost range, best usage, and more.","pla-polylactic-acid#PLA (Polylactic Acid)":"PLA is one of the most common materials used in 3D printing, known for its ease of use and large variety of colors.\nProperty\tPLA (Standard)\tPLA+\tMatt PLA\tSilk PLA\tGlow PLA\tFlexible PLA\tWood Filled PLA\tLight Weight PLA\tAdvantages\tVery strong, large variety of colors, easy to print\tSlightly stronger, better adhesion\tMore textured finish, hides seams\tShiny/glossy finish, metallic colors\tGlows in the dark\tIncreased impact resistance\tSandable, stainable like real wood\tCan reduce weight by 70%\tDisadvantages\tBrittle, low impact resistance, softens at high temps\tSlightly more expensive\tWeaker layer adhesion\tMore brittle, harder to print\tAbrasive to nozzles, higher clogging tendency\tDifficult to print\tClogs easily, recommend steel nozzle\tChallenging to print correctly\tCost Range\t$10 - $30\t$15 - $35\t$15 - $30\t$15 - $30\t$25 - $45\t$25 - $45\t$30 - $65\t$30 - $65\tBest Usage\tClassroom models, prototypes, aesthetic models\tThin sections with few walls\tAesthetic models, textured models\tHighly aesthetic models\tHalloween models\tFlexibility or shock resistance, drones, robots\tWood texture models\tLightweight models, cosplay, drones\tBest if Dried\tFALSE\tFALSE\tFALSE\tFALSE\tFALSE\tTRUE\tTRUE\tTRUE","petg-polyethylene-terephthalate-glycol#PETG (Polyethylene Terephthalate Glycol)":"PETG is a strong, impact-resistant material often used for outdoor and mechanical parts.\nProperty\tPETG (Standard)\tPETG (Transparent)\tAdvantages\tMore impact resistant than PLA, higher temperature and weather resistance\tOpaque but not truly clear\tDisadvantages\tTendency to string and warp without an enclosure\tNo major disadvantages compared to standard PETG\tCost Range\t$12 - $30\t$12 - $30\tBest Usage\tOutdoor parts, mechanical parts\tSame as standard PETG\tBest if Dried\tTRUE\tTRUE","asa-acrylonitrile-styrene-acrylate#ASA (Acrylonitrile Styrene Acrylate)":"ASA is a great choice for outdoor parts due to its UV and chemical resistance.\nProperty\tASA (Standard)\tASA (Light Weight/Foaming)\tAdvantages\tUV and chemical resistant, high temperature resistance, strong\tReduces weight by 70%, density varies by temperature\tDisadvantages\tRequires an enclosed printer, high bed temps (100°C+), unpleasant odor\tVery difficult to print\tCost Range\t$15 - $45\t$35 - $65\tBest Usage\tOutdoor parts, automotive parts\tAircraft wings, wind turbines, drones\tBest if Dried\tTRUE\tTRUE","abs-acrylonitrile-butadiene-styrene#ABS (Acrylonitrile Butadiene Styrene)":"ABS is a very strong, high-temperature-resistant material suitable for rigid parts.\nProperty\tABS (Standard)\tAdvantages\tHigh strength, rigidity, hardness, high temperature resistance\tDisadvantages\tRequires higher printing temperatures, warps without proper cooling\tCost Range\tN/A\tBest Usage\tHigh-temperature resistant parts, rigid structures\tBest if Dried\tN/A","tpu-thermoplastic-polyurethane---flexible#TPU (Thermoplastic Polyurethane) - Flexible":"TPU is a flexible material that is commonly used for applications needing elasticity.\nProperty\t75D\t95A\t75A\t83A\tAdvantages\tFlexible, durable\tFlexible, durable\tHighly elastic\tHighly elastic\tDisadvantages\tDifficult to print with fine details\tRequires specific print settings\tChallenging for beginners\tChallenging to print with\tCost Range\tN/A\tN/A\tN/A\tN/A\tBest Usage\tFlexible parts\tFlexible parts\tFlexible models\tFlexible models\tBest if Dried\tTRUE\tTRUE\tTRUE\tTRUE","reinforced-materials#Reinforced Materials":"Reinforced materials are typically combined with fibers (like carbon fiber or glass fiber) to increase strength and durability.\nProperty\tReinforced PLA\tCarbon Fiber PETG\tCarbon Fiber ASA\tGlass Fiber Nylon\tAdvantages\tIncreased strength, more rigid than standard PLA\tStronger and stiffer than regular PETG\tExcellent UV and chemical resistance, high rigidity\tVery strong and impact resistant\tDisadvantages\tMore brittle than regular PLA\tRequires a hardened nozzle, can be abrasive\tRequires an enclosed printer, harder to print\tChallenging to print, high cost\tCost Range\t$30 - $60\t$50 - $100\t$45 - $85\t$50 - $150\tBest Usage\tHigh-strength models, parts requiring stiffness\tStrong mechanical parts, drone frames\tOutdoor parts, parts for cars and aerospace\tHeavy-duty, structural applications\tBest if Dried\tTRUE\tTRUE\tTRUE\tTRUE","specialty-materials#Specialty Materials":"Specialty materials can include exotic filaments like metal-filled, ceramic, or flexible composites.\nProperty\tMetal-Filled PLA\tCeramic-Filled PLA\tConductive PLA\tAdvantages\tAesthetic metal finish, easy to print\tCeramic-like finish, smooth surface\tConductive properties, good for electronics\tDisadvantages\tRequires a hardened nozzle, heavier\tBrittle, more challenging to print\tRequires special printing conditions\tCost Range\t$50 - $100\t$60 - $120\t$60 - $150\tBest Usage\tDecorative models, jewelry\tArt pieces, high-detailed models\tElectronics, sensors\tBest if Dried\tTRUE\tTRUE\tTRUE"}},"/Mechanical/Hardware-Definitions":{"title":"Overview Hardware Definitions","data":{"components-quick-links#Components Quick Links":"Hotend\nMotion System\nExtrusion System\nHeated Build Plates\nOther Components","hotend-components-defined#Hotend Components Defined":"Nozzle\nResponsible for Extruding molten Plastic onto a heated surface.\nThe Nozzle is the hottest part of the 3D Printer. Temperatures can reach 300° C or 572° F. Contact when active can lead to injury.\nHeater\nUsually a DC cartridge with a heating element\nThermistor\nReports the current temperature to the controller. Ensures that the nozzle is heating as expected.\nThe thermistor is the most important safety feature of an FFF 3D printer. All modern 3D printers have thermal runaway protections that will alert and shut down the printer. Thermal runaway occurs when a Nozzle continues to receive power without raising the temperature as expected.\nHeatbreak\nThe heatbreak is the part of the nozzle where filament moves from a solid to molten plastic.\nThis is where the majority of extrusion issues occur. If the filament is heated too far past its transition point it can melt too far up the heatbreak resulting in a \"Jam\".\nHeatsink\nAn aluminum block meant to disperse heat and keep the filament solid until it reaches the melt zone\nHotend Cooling Fan\nNormally attached to the heatsink, removes heat before the \"melt zone\"\nThis is very important to the extrusion system, if this fan stops or is obstructed the hotend will jam.\nPart Cooling Fan\nThis component transitions the molten plastic from a molten state to a solid state\nSome materials require 100% fan and others may warp. Some may even suffer poor layer adhesion. Fan speed is material specific.\nAll-In-One Hotend\nAll in one hotends have become a popular option with manufacturers. They come pre-assembled and are meant to be changed as a set of components.","motion-systems-defined#Motion Systems Defined":"Most Common\nCartesian  - 1 motor per axis X,Y,Z\nCoreXY - X and Y belts both attached to the Hotend. Motion is derived from a combination\nLess Common\nDelta - 3 motors move together for one X,Y,Z movement\nHybrid CoreXY - 2 X axis Motors in a Core XY Configuration, Dependent dual Y axis motors.\nIDEX - 2 Independent Tool heads with a common Y axis but independent X axis","extrusion-systems-defined#Extrusion Systems Defined":"Bowden Extrusion\nRemote Filament Extruder that Feeds filament into the hotend but is not attached to the X gantry itself.\nDirect Drive\nThe Filament Extruder is Directly Attached to the Hotend Assembly.\nLess Common Systems\nIDEX - 2 separate independent hotends.\nTool Changer - One motion system that can dock and select multiple hotends\nMultiplexing - 2 complete hotends on a single Tool","heated-build-plates#Heated Build Plates":"Heated Plate Types\nSilicon Heater Pads - Typically DC heaters placed on the underside of an aluminum Plate\nBed Leveling Screws - Adjust the tramming of the Bed\nHeatbed Thermistor - Like the hotend the heated bed thermistor ensures the bed is heating properly.","build-plate-materials#Build Plate Materials":"Surface Materials\nGlass - Tempered Glass often with a texture applied\nPEI - Smooth and textured surface coating on a spring steel sheet\nGarolite / G10 - Carbon fiber based surface","other-components#Other Components":"Auto Bed Leveling Sensor Types\nInductive\nMicroswitch\nForce / Piezo Sensor"}},"/Mechanical/Limmitiaions":{"title":"FDM 3D Printing Physical Limmitiations","data":{"":"All 3d Printed models only retain ~ 40% strength in the Z axis due to layer adheasion","curved-surfaces-on-the-z-axis-aka-salmon-skin#Curved Surfaces on the Z axis aka \"Salmon Skin\"":"Causes:\nJust like slicing an apple and putting those slicecs back together. FDM printing builds objects by layering platic at set heights. Continuious curved surfaces are problimatic in the Z axis.\nSolutions:\nUsing Adaptive Layer Heights\nChanfers not Fillets on bottom layers.\nEXAMPLE:","overhangs#Overhangs":"Cause:\nGravity + Molten Plastic\nSolutions:\n3d Printer Supports (see section of supports)\nEnsure the Modle has no overhang greater than 45 degrees\nEXAMPLE:","printing-in-thin-air#Printing in Thin Air":"Cause:\nGravity, Model has a region that is floating.\nSoultin:\nIf THis is nessessary the only solution is to use supports."}},"/Mechanical/Nozzles":{"title":"Recomendaton","data":{"nozzle-and-layer-height-guide#Nozzle and Layer Height Guide":"Model printing times are most affected by a cobonation of layer heright and nozzle size.\nThe majority of 3d printers will come standard with a 0.4 mm nozzle made of brass. A good middle ground between qualty and time is 0.2 mm layer heights.\nNozzle Size\tLayer Height\t0.4 mm\t0.2 mm\t\nComparison table: nozzle size | print time | max / min Layer height\nNozzle Size\tMin Layer Height\t25×25×25 mm Cube Time\tMax Layer Height\t25×25×25 mm Cube Time\tRecommended Line Width\tMax Line Width (+120%)\t0.4 mm\t0.08 mm\t~47 min\t0.28 mm\t~9 min\t0.45 mm\t0.6 mm\t0.6 mm\t0.18 mm\t~12 min\t0.42 mm\t~6.5 min\t0.62 mm\t0.8 mm\t0.8 mm\t0.24 mm\t~9 min\t0.56 mm\t~7 min\t0.82 mm\t1.0 mm\t0.2 mm\t0.06 mm\t~90 min\t0.14 mm\t~45 min\t0.22 mm\t0.3 mm","nozzle-materal#Nozzle Materal":"Materal\tMateral Usage\tCost\tNotes\tOther Considerations\tBrass\tNon abrasive\t$\tStandard on most printers\tReplace often when print quality is lost\tSteal\tAbrasive\t$$\tMore abrasion resistance\tMay require slightly higher temperature\tHardened Steal\tAbrasive\t$$$\tRecomended for abrasive materals\tMay require slightly higher temperature\tDimond Back\tAbrasive\t$$$$$$\tWill last forever\tMay require slightly higher temperature\t\nTypes\tNotes\tMk4 / 8\tSeen on older printers, not as common today\tBondtech CHT\tHigh flow Mk4 / 8\tAll in one\tVendor specific has all hotend components"}},"/Modeling_for_Printing":{"title":"Modeling for Printing","data":{}},"/Other_Useful/3d_Viewer":{"title":"3d Viewer","data":{}},"/Other_Useful/Luban3d":{"title":"Luban3d","data":{}},"/Other_Useful/MakerWorld_MakerLab":{"title":"Makerworld Makerlab","data":{}},"/Other_Useful/Meshmixer":{"title":"Meshmixer","data":{}},"/Other_Useful/OpenScad":{"title":"Openscad","data":{}},"/Other_Useful/Using_Images/GIMP":{"title":"Gimp","data":{}},"/Other_Useful/Using_Images/HueForge":{"title":"Hueforge","data":{}},"/Other_Useful/Using_Images/Inksacpes":{"title":"Inksacpes","data":{}},"/Postprocessing":{"title":"Postprocessing","data":{}},"/Print_Preperation/Sliceing_Software/Bambu_Studio":{"title":"Bambu Studio","data":{}},"/Print_Preperation/Sliceing_Software/Kiri:Moto":{"title":"Kiri:Moto","data":{}},"/Print_Preperation/Sliceing_Software/Orca":{"title":"Orca","data":{}},"/Print_Preperation/Sliceing_Software/Prusa":{"title":"Prusa","data":{}},"/Print_Preperation/Sliceing_Software/Slicer_Overview":{"title":"Slicer Overview","data":{}},"/Print_Preperation/Sliceing_Software/slicer_list":{"title":"Slicer List","data":{}},"/Print_Preperation/Slicing_General/Best_Pratices":{"title":"Best Pratices","data":{}},"/Print_Preperation/Slicing_General/Large_Models":{"title":"Large Models","data":{}},"/Print_Preperation/Slicing_General/Limmitations":{"title":"Limmitations","data":{}},"/Print_Preperation/Slicing_General/Overhangs":{"title":"Overhangs","data":{}},"/Print_Preperation/Slicing_General/Slicing_Peramiters_Features":{"title":"Slicing Peramiters Features","data":{}},"/Print_Preperation/Slicing_General/supports":{"title":"Supports","data":{}},"/Printers/Manufactures":{"title":"Manufactures","data":{"3d-printer-maufacturers---consumer-grade#3d Printer Maufacturers - Consumer Grade":"AnycubicBambu LabsCrealityElegooFlsunFlash FrogeSolvoPrusa","3d-printer-maufacuters---proffessional#3d Printer Maufacuters - Proffessional":"3DXTechMarkforgedModixRaise3DUltimakerVision Miner","retailers#Retailers":"AmazonBestBuyMatterHackersMicroCenterPrintedSolid\nPrusa EDU Dealer","parts--components#Parts & Components":"FabreekoKb-3dWest-3D","kits--diy#Kits & Diy":"VoronRatRigVZBot"}},"/Printers/What_to_look_for":{"title":"Minimum Printer Recomendation","data":{"":"Modern 3d Printers have made several advances over the last few years.\r\nAs of 2025 here are some recomended Features","auto-bed-leveling-abl#Auto Bed Leveling (ABL).":"Consistant Z-offset distance between the nozzle and build surface\nBed Mesh Compensation\nAll build surfaces have veration in hight over the entire surface. The printer uses the probe to map those differances. The printer then activly adjusts the nozzle height acordingly over the bottom surface durring the print.","enclosed-vs-open-#Enclosed vs Open :":"Encloded Printers are recomended for most materals other than PLA and PETG\nPrinting PLA with and enclosed printer at too high temperatures may result in a clogged heatbreak.","direct-drive-extruder#Direct Drive Extruder:":"Shorter Filiment path more acurate extrusion\nHighly recomded for flexable materals","input-shaper#Input Shaper":"Input Spapper / vibration compencation is a firmware utility where the 3d printer oscillates the x and y axis at diferent frequentcies. The resulting information is used to provide counter frequencys when priinting to increase print speed and quality.","presure-advance#Presure Advance":"Pressure Advance is a firmware / slicer tool that calibrates the amount of materal that is extruded after the extruder stops pushing the filiment. This increases the acuracy of the extruded line width.","air-filtration#Air Filtration":"3d printed materal of all verieties release gases when extruded. Some of thise gases in suffichient quantities can irritate the sinuses of people exposed to large amounts. Some 3d printer come equipted with carbon filters.\r\nNormally this is not a isue in larger spaced that are well ventilated. However materals like ASA an ABS may have an unpleasent oder.","heated-chanber#Heated Chanber":"Only Nessessary for higher temp engenering materaly, however it can be bennificial for noremal materals.","wifi-or-lan-internet-connection#Wifi or LAN internet connection":"These printers often have the ability to send , start, monitor and stop 3d print jobs from a device such as a computer or smartphone. This is a quality of life improvment and the ability to stop a failed print remmotly can save mechanical damage.","printer-size#Printer size":"This is dependent on use case:\nmodels\tx\ty\tz\tx\ty\tz\tCost\t~ 75%\t180 mm\t180 mm\t180 mm\t7 in\t7 in\t7 in\t$\t~ 95%\t250 mm\t250 mm\t250 mm\t9.5 in\t9.5 in\t9.5 in\t$$\t~ 98%\t350 mm\t350 mm\t350 mm\t13 in\t13 in\t13 in\t$$$\t\nnote : A full size 3d printed helment that has not been seperated into parts requires greater that 250 mm on average.\nPlease Note this is only my openion based on my personal observation."}},"/Recomended_Settings":{"title":"Recomended Settings","data":{}},"/Repositories":{"title":"Repositories","data":{}},"/Subjuect_models":{"title":"Subjuect Models","data":{}},"/Teacher":{"title":"Teacher","data":{}},"/Troubleshooting/Bed_Adheason":{"title":"Bed Adheason","data":{}},"/Troubleshooting/Extrussion_issues":{"title":"Extrussion Issues","data":{}},"/Troubleshooting/Mechanical_Issues":{"title":"Mechanical Issues","data":{}},"/Troubleshooting/Quality_Issues":{"title":"Quality Issues","data":{}},"/YouTube":{"title":"Youtube","data":{}},"/":{"title":"Welcome to info3d","data":{"":"This is your documentation homepage."}}}